tinyNozzle/2D/5_with3outlets_cyclic_flush_03(use)/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            wedge;
        nFaces          22212;
        startFace       43951;
    }
    back
    {
        type            wedge;
        nFaces          22212;
        startFace       66163;
    }
    inlet
    {
        type            patch;
        nFaces          9;
        startFace       88375;
    }
    outlet
    {
        type            patch;
        nFaces          401;
        startFace       88384;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       88785;
    }
)

// ************************************************************************* //
